# Что значит if __name__ == "__main__": в конце программы? 
# Я понимаю, что это используется для вызова ф-ции main(),
# но не понимаю, почему нельзя было просто её вызвать,
# а ещё не могу понять, что такое __name__ 
"""

Домашнее задание №1

Условный оператор: Возраст

* Попросить пользователя ввести возраст при помощи input и положить 
  результат в переменную
* Написать функцию, которая по возрасту определит, чем должен заниматься пользователь: 
  учиться в детском саду, школе, ВУЗе или работать
* Вызвать функцию, передав ей возраст пользователя и положить результат 
  работы функции в переменную
* Вывести содержимое переменной на экран

"""

def main():
    """
    Эта функция вызывается автоматически при запуске скрипта в консоли
    В ней надо заменить pass на ваш код
    """
    aegis = int(input("Введите Ваш возраст: "))
    if aegis < 0:
        print("Введите корректный возраст: ")
        aegis = int(input())
    if 0 <= aegis < 7:
        print("Пользователь должен ходить в детский сад.")
    elif 7 <= aegis < 18:
        print("Пользователь должен ходить в школу.")
    elif 18 <= aegis < 23:
        print("Пользователь должен ходить в ВУЗ.")
    else:
        print("Пользователь должен работать.")


if __name__ == "__main__":
    main()
